-- -*- M2-comint -*- hash: 575821745
--loading configuration for package "SOS" from file /Users/tom/Library/Application Support/Macaulay2/init-SOS.m2
Warning: csdp executable was not found.
Warning: sdpa executable was not found.
Warning: mosek executable was not found.

i1 : R = QQ[x,y];

i2 : f = 2*x^4+5*y^4-2*x^2*y^2+2*x^3*y;

i3 : sol = solveSOS f;
Running M2 Solver
Status: SDP solved, dual feasible
Start rational rounding

i4 : s = sosPoly sol

o4 = coeffs:
         12   923
     {5, --, ----}
          5  1500
     gens:
        11 2    2   5 2         2
     {- --x  + y , --x  + x*y, x }
        25         12

o4 : SOSPoly

i5 : sumSOS(s)

       4     3      2 2     4
o5 = 2x  + 2x y - 2x y  + 5y

o5 : R

i6 : R = QQ[x,y];

i7 : S = R/ideal(x^2 + y^2 - 1);

i8 : f = 10-x^2-y;

i9 : sol = solveSOS (f, 2);
Running M2 Solver
Status: SDP solved, dual feasible
Start rational rounding

i10 : sosPoly sol

o10 = coeffs:
       55  47  1359
      {--, --, ----}
        8   8   440
      gens:
            4
      {y - --, x, 1}
           55

o10 : SOSPoly

i11 : 
