Maybe some of these should work:

i17 : promote(pi,RR_2000)
stdio:17:1:(3): error: no method found for applying promote to:
     argument 1 :  pi (of class Constant)
     argument 2 :  RR
                     2000

i18 : toRR_1000 pi
stdio:18:5:(3): error: expected argument 1 to be an integral, rational, or real number

i19 : toRR pi
stdio:19:1:(3): error: expected an integral, rational, or real number, or a pair

i20 : pi + 0.

o20 = 3.1415926535897932384626433833

o20 : RR (of precision 97)

i21 : numeric_1000 pi

o21 = 3.141592653589793238462643383279502884197169399375105820974944592307816
      40628620899862803482534211706798214808651328230664709384460955058223172
      53594081284811174502841027019385211055596446229489549303819644288109756
      65933446128475648233786783165271201909145648566923460348610454326648213
      393607260249141274

o21 : RR (of precision 1000)

i22 : pi + 0.p1000

o22 = 3.141592653589793238462643383279502884197169399375105820974944592307816
      40628620899862803482534211706798214808651328230664709384460955058223172
      53594081284811174502841027019385211055596446229489549303819644288109756
      65933446128475648233786783165271201909145648566923460348610454326648213
      393607260249141274

o22 : RR (of precision 1000)
