-- -*- M2-comint -*- {* hash: -1518583579 *}
-- COMPILE TIME: May 22 2017, 12:08:38
--loading configuration for package "NumericalAlgebraicGeometry" from file /nethome/aleykin3/.Macaulay2/init-NumericalAlgebraicGeometry.m2
--loading configuration for package "PHCpack" from file /nethome/aleykin3/.Macaulay2/init-PHCpack.m2
--loading configuration for package "Bertini" from file /nethome/aleykin3/.Macaulay2/init-Bertini.m2

i1 : 1--a basic example will go here

o1 = 1

i2 : 2--another simple xample with targetsolcount=>true

o2 = 2

i3 : 3--a simple example of a parametric system goes here

o3 = 3

i4 : R = CC[a_1..a_5,b_1..b_5][x,y,z,t,u]

o4 = R

o4 : PolynomialRing

i5 : P = polySystem {-a_1+b_1*(x^2-y^2+z^2+u^2-t^2),-a_2+b_2*(x^3-y^3+z^3+u^3-t^3),-a_3+b_3*(x^4-y^4+z^4+u^4-t^4),-a_4+b_4*(x^5-y^5+z^5+u^5-t^5), -a_5+b_5*(x^6-y^6+z^6+u^6-t^6)}

o5 = P

o5 : PolySystem

i6 : R = CC[a,b,c,d][x,y];

i7 : polys = polySystem {a*x+b*y^2,c*x*y+d};

i8 : (V, npaths) = monodromySolve polys;

i9 : << "tracked " << npaths << " homotopy paths";
tracked 12 homotopy paths
i10 : V.BasePoint

o10 = {.426984-.623895*ii, .586863-.476605*ii, -.592971+.277174*ii, -.654396+.014331*ii}

o10 : Point

i11 : points V.PartialSols

o11 = {{.781262-.624203*ii, -.462954-.886382*ii}, {.149945+.988694*ii,
      -----------------------------------------------------------------------
      -.536153+.844121*ii}, {-.931207-.364491*ii, .999107+.042261*ii}}

o11 : List

i12 : 
