-- -*- M2-comint -*- {* hash: 735262692 *}
-- COMPILE TIME: May 22 2017, 12:08:38
--loading configuration for package "NumericalAlgebraicGeometry" from file /nethome/aleykin3/.Macaulay2/init-NumericalAlgebraicGeometry.m2
--loading configuration for package "PHCpack" from file /nethome/aleykin3/.Macaulay2/init-PHCpack.m2
--loading configuration for package "Bertini" from file /nethome/aleykin3/.Macaulay2/init-Bertini.m2

i1 : setRandomSeed 0

o1 = 0

i2 : R=CC[x,y,z]

o2 = R

o2 : PolynomialRing

i3 : F=random(3,R)
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

                            3                            2                
o3 = (.781262 - .624203*ii)x  + (- .462954 - .886382*ii)x y + (- .670948 -
     ------------------------------------------------------------------------
                   2                          3                            2 
     .741504*ii)x*y  + (.778029 - .628229*ii)y  + (- .272832 + .962062*ii)x z
     ------------------------------------------------------------------------
                                                          2                
     + (.9868 + .161945*ii)x*y*z + (.118767 + .992922*ii)y z + (- .219207 -
     ------------------------------------------------------------------------
                   2                              2             
     .975678*ii)x*z  + (- .971549 + .236839*ii)y*z  + (.157598 -
     ------------------------------------------------------------------------
                 3
     .987503*ii)z

o3 : R

i4 : P=sum apply(gens R,g->diff(g,F)*random CC)

                            2                                           
o4 = (1.27972 - 2.17943*ii)x  + (.964676 - 1.04591*ii)x*y + (- .500957 +
     ------------------------------------------------------------------------
                 2                                                          
     3.56969*ii)y  + (.527086 + .814973*ii)x*z + (- 2.94832 - 1.41706*ii)y*z
     ------------------------------------------------------------------------
                            2
     + (1.2095 - 4.1219*ii)z

o4 : R

i5 : sparseMonodromySolve polySystem {F,P,random(1,R)-1}

o5 = {{.696205+.717843*ii, -.028156+.999604*ii, -.056229-.998418*ii},
     ------------------------------------------------------------------------
     {-.584221+.75978*ii, -.264489+1.00578*ii, -1.12056-.396538*ii},
     ------------------------------------------------------------------------
     {-.475489+.620864*ii, -.302422-.574239*ii, .200457-.0863253*ii},
     ------------------------------------------------------------------------
     {-.298298-1.14773*ii, .704336-.609524*ii, -.997057-.963763*ii},
     ------------------------------------------------------------------------
     {4.0481-2.4332*ii, 3.57576-2.29537*ii, 2.60266-1.79354*ii},
     ------------------------------------------------------------------------
     {.110243+.273707*ii, .293222-.323907*ii, .121796-.346369*ii}}

o5 : List

i6 : setRandomSeed 0

o6 = 0

i7 : R = CC[a_1..a_5,b_1..b_5][x,y,z,t,u]

o7 = R

o7 : PolynomialRing

i8 : P = polySystem {-a_1+b_1*(x^2-y^2+z^2+u^2-t^2),-a_2+b_2*(x^3-y^3+z^3+u^3-t^3),-a_3+b_3*(x^4-y^4+z^4+u^4-t^4),-a_4+b_4*(x^5-y^5+z^5+u^5-t^5), -a_5+b_5*(x^6-y^6+z^6+u^6-t^6)}

o8 = P

o8 : PolySystem

i9 : (N,npaths) = monodromySolve P

o9 = (HomotopyNode{...5...}, 576)

o9 : Sequence

i10 : N.SpecializedSystem -- a randomly generated system in the family defined by P

                                2                          2               
o10 = {(- .272372 - .962192*ii)x  + (.272372 + .962192*ii)y  + (- .272372 -
      -----------------------------------------------------------------------
                  2                          2                            2  
      .962192*ii)z  + (.272372 + .962192*ii)t  + (- .272372 - .962192*ii)u  -
      -----------------------------------------------------------------------
                                                   3               
      .841103 + .540875*ii, (.696205 + .717843*ii)x  + (- .696205 -
      -----------------------------------------------------------------------
                  3                          3                            3  
      .717843*ii)y  + (.696205 + .717843*ii)z  + (- .696205 - .717843*ii)t  +
      -----------------------------------------------------------------------
                             3                                      
      (.696205 + .717843*ii)u  + .396553 - .918012*ii, (- .0281556 +
      -----------------------------------------------------------------------
                  4                           4                             4
      .999604*ii)x  + (.0281556 - .999604*ii)y  + (- .0281556 + .999604*ii)z 
      -----------------------------------------------------------------------
                                4                             4            
      + (.0281556 - .999604*ii)t  + (- .0281556 + .999604*ii)u  - .893324 -
      -----------------------------------------------------------------------
                                            5                           5  
      .449414*ii, (- .0562287 - .998418*ii)x  + (.0562287 + .998418*ii)y  +
      -----------------------------------------------------------------------
                                5                           5                
      (- .0562287 - .998418*ii)z  + (.0562287 + .998418*ii)t  + (- .0562287 -
      -----------------------------------------------------------------------
                  5                                                6     
      .998418*ii)u  - .360485 + .932765*ii, (.776937 + .629579*ii)x  + (-
      -----------------------------------------------------------------------
                            6                          6               
      .776937 - .629579*ii)y  + (.776937 + .629579*ii)z  + (- .776937 -
      -----------------------------------------------------------------------
                  6                          6
      .629579*ii)t  + (.776937 + .629579*ii)u  + .651048 - .759036*ii}

o10 : List

i11 : first N.PartialSols -- a solution to N.SpecializedSystem

o11 = {.851837+.102702*ii, -.312865+.878644*ii, .053494+.506022*ii, -.606275-.104337*ii, -.208647-.72906*ii}

o11 : Point

i12 : npaths -- total number of paths tracked in call to monodromySolver

o12 = 576

i13 : 
