<<<<<<< HEAD
-- -*- M2-comint -*- {* hash: -2072580136 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : CC[x,y]; F = {x^2-1,y^2-1};

i3 : bertiniZeroDimSolve(F,RandomSeed=>0,TrackTolBeforeEG=>1e-6,FinalTol=>1e-100)
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-34334-0/1
=======
-- -*- M2-comint -*- {* hash: 1403958296 *}
-- COMPILE TIME: Oct 14 2015, 14:51:21
--loading configuration for package "Bertini" from file /nethome/aleykin3/.Macaulay2/init-Bertini.m2

i1 : CC[x,y]; F = {x^2-1,y^2-1};

i3 : bertiniZeroDimSolve(F,RANDOMSEED=>0,TRACKTOLBEFOREEG=>1e-6,FINALTOL=>1e-100)
Temporary directory for input and output files:/tmp/M2-29920-0/1
>>>>>>> Macaulay2/master

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o3 = {{-1, -1}, {-1, 1}, {1, -1}, {1, 1}}

o3 : List

i4 : opts = new OptionTable from {RandomSeed=>0,TrackTolBeforeEG=>1e-6,FinalTol=>1e-100}

o4 = OptionTable{FinalTol => 1e-100         }
                 RandomSeed => 0
                 TrackTolBeforeEG => .000001

o4 : OptionTable

i5 : bertiniZeroDimSolve(F,opts)
<<<<<<< HEAD
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-34334-0/2
=======
Temporary directory for input and output files:/tmp/M2-29920-0/2
>>>>>>> Macaulay2/master

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o5 = {{-1, -1}, {-1, 1}, {1, -1}, {1, 1}}

o5 : List

i6 : G = {x^2+y^2-1};

i7 : bertiniPosDimSolve(G,opts)
<<<<<<< HEAD
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-34334-0/3
=======
Temporary directory for input and output files:/tmp/M2-29920-0/3
>>>>>>> Macaulay2/master

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o7 = a numerical variety with components in
     dim 1:  [dim=1,deg=2]

o7 : NumericalVariety

i8 : 
