-- -*- M2-comint -*- {* hash: -1067040464 *}
--loading configuration for package "Bertini" from file /Users/elizabethgross/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R = CC[x,y,z];

i2 : f = {(x^2+y^2-z^2)*(z-x),(x^2+y^2-z^2)*(z+y)};

i3 : bertiniPosDimSolve(f,ISPROJECTIVE=>1);
Temporary directory for input and output files:/var/folders/kq/sl97ymz57zd0w0hwh4drs33c0000gn/T/M2-20234-0/0

The version of Bertini you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


i4 : R=CC[x,y,z,u1,u2];--u1,u2 are parameters

i5 : f1=x^2+y^2-z^2;

i6 : f2=u1*x+u2*y;

i7 : finalParameters={{0,1}};

i8 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2},{finalParameters },ISPROJECTIVE=>1)
Temporary directory for input and output files:/var/folders/kq/sl97ymz57zd0w0hwh4drs33c0000gn/T/M2-20234-0/1

The version of Bertini you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o8 = {{{-1.335-1.09595*ii, 8.23994e-18+3.11708e-18*ii, -1.335-1.09595*ii},
     ------------------------------------------------------------------------
     {-.439627+.341924*ii, 2.45301e-18-5.42101e-19*ii, .439627-.341924*ii}}}

o8 : List

i9 : 
