-- -*- M2-comint -*- {* hash: -644878192 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R=CC[x0,x1,x2]

o1 = R

o1 : PolynomialRing

i2 : F={x0^3-x1^3+x2^3+1}

        3     3     3
o2 = {x0  - x1  + x2  + 1}

o2 : List

i3 : sliceH=makeB'Slice({2},{{x0,x1,x2,1}},NameB'Slice=>"H")
2
{{}, {}}

o3 = B'Slice{...4...}

o3 : B'Slice

i4 : makeB'InputFile(storeBM2Files,
         AffVariableGroup=>{x0,x1,x2},
         ParameterGroup=>{T},
         B'Configs=>{{ParameterHomotopy,1}},
         B'Functions=>{sliceH},
         B'Polynomials=>{"H0+T","H1"}|F)

o4 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-42234-0/0/input

o4 : File

i5 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i6 : b'TraceTestImage(storeBM2Files)
~/bertini
~/bertini

o6 = {3.33067e-16+2.22045e-15*ii, -2.22045e-15-1.11022e-16*ii,
     ------------------------------------------------------------------------
     8.88178e-16+2.66454e-15*ii}

o6 : List

i7 : R=CC[x,y,z]**CC[a,b]

o7 = R

o7 : PolynomialRing

i8 : xyzSub={{x,a},{y,a^2+b},{z,a^2+b^2}}

                   2            2    2
o8 = {{x, a}, {y, a  + b}, {z, a  + b }}

o8 : List

i9 : sliceH=makeB'Slice({2},{{x,y,z,1}},NameB'Slice=>"H")
2
{{}, {}}

o9 = B'Slice{...4...}

o9 : B'Slice

i10 : makeB'InputFile(storeBM2Files,
          AffVariableGroup=>{a,b},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>xyzSub|{sliceH},
          B'Polynomials=>{"H1","H0+T"})

o10 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-42234-0/0/input

o10 : File

i11 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i12 : s=importSolutionsFile(storeBM2Files)

o12 = {{.316096+1.18381*ii, -1.99747+.565633*ii}, {-.176496+3.12425*ii,
      -----------------------------------------------------------------------
      3.93018+.028929*ii}, {-.618758-.45534*ii, -.215444+.735624*ii},
      -----------------------------------------------------------------------
      {-1.21839-.844381*ii, .282728-1.33019*ii}}

o12 : List

i13 : b'TraceTestImage(storeBM2Files,MapPoints=>({a,a^2+b,a^2+b^2},{a,b}))
~/bertini
~/bertini

o13 = {1.55431e-15 + 1.77636e-15*ii, - 3.55271e-15 + 1.77636e-15*ii, -
      -----------------------------------------------------------------------
      8.88178e-15 - 1.15463e-14*ii}

o13 : List

i14 : R=CC[x0,x1,x2]

o14 = R

o14 : PolynomialRing

i15 : F={x0^3-x1^3+x2^3+1}

         3     3     3
o15 = {x0  - x1  + x2  + 1}

o15 : List

i16 : sliceH=makeB'Slice(2,{x0,x1,x2,1},NameB'Slice=>"H")
2
{{}, {}}

o16 = B'Slice{...4...}

o16 : B'Slice

i17 : makeB'InputFile(storeBM2Files,
          AffVariableGroup=>{x0,x1,x2},
          ParameterGroup=>{T},
          B'Configs=>{{ParameterHomotopy,1}},
          B'Functions=>{sliceH},
          B'Polynomials=>{"H0+T","H1"}|F)

o17 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-42234-0/0/input

o17 : File

i18 : runBertini(storeBM2Files,PreparePH2=>true)
~/bertini

i19 : b'TraceTestImage(storeBM2Files,StopBeforeTest=>true)--Returns the trace for each parameter homotopy using -gammma, 0, and gamma respectively.
~/bertini
~/bertini

o19 = {{-.606251+1.0391*ii, .0281981+.33913*ii, -.983967-.366874*ii},
      -----------------------------------------------------------------------
      {-.965682+.739285*ii, .0665426+.234825*ii, -.852729+.011806*ii},
      -----------------------------------------------------------------------
      {-1.32511+.439468*ii, .104887+.13052*ii, -.721492+.390485*ii}}

o19 : List

i20 : 
