-- -*- M2-comint -*- {* hash: -1818738321 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R=CC[u1,u2,u3,x,y];

i2 : f1=u1*(y-1)+u2*(y-2)+u3*(y-3); --parameters are u1, u2, and u3

i3 : f2=(x-11)*(x-12)*(x-13)-u1;

i4 : paramValues0={{1,0,0}};

i5 : paramValues1={{0,1+2*ii,0}};

i6 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2,u3},{paramValues0 ,paramValues1 })
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-34476-0/1

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o6 = {{{11.3376-.56228*ii, 1}, {11.3376+.56228*ii, 1}, {13.3247, 1}}, {{11,
     ------------------------------------------------------------------------
     2}, {12, 2}, {13, 2}}}

o6 : List

i7 : bPH_0--the solutions to the system with parameters set equal to paramValues0

o7 = {{11.3376-.56228*ii, 1}, {11.3376+.56228*ii, 1}, {13.3247, 1}}

o7 : List

i8 : R=CC[x,y,z,u1,u2]

o8 = R

o8 : PolynomialRing

i9 : f1=x^2+y^2-z^2

      2    2    2
o9 = x  + y  - z

o9 : R

i10 : f2=u1*x+u2*y

o10 = x*u1 + y*u2

o10 : R

i11 : finalParameters0={{0,1}}

o11 = {{0, 1}}

o11 : List

i12 : finalParameters1={{1,0}}

o12 = {{1, 0}}

o12 : List

i13 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2},{finalParameters0 ,finalParameters1 },IsProjective=>1)
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-34476-0/3

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o13 = {{{.430111+.518729*ii, -8.37546e-18+2.4395e-19*ii, .430111+.518729*ii},
      -----------------------------------------------------------------------
      {.61274-.645193*ii, -1.6263e-19+7.58942e-19*ii, -.61274+.645193*ii}},
      -----------------------------------------------------------------------
      {{-1.04626e-17+1.29461e-17*ii, -.897674-.40584*ii, .897674+.40584*ii},
      -----------------------------------------------------------------------
      {-1.86347e-18-2.60209e-18*ii, -.256191+.524602*ii,
      -----------------------------------------------------------------------
      -.256191+.524602*ii}}}

o13 : List

i14 : bPH_0--The two solutions for finalParameters0

o14 = {{.430111+.518729*ii, -8.37546e-18+2.4395e-19*ii, .430111+.518729*ii},
      -----------------------------------------------------------------------
      {.61274-.645193*ii, -1.6263e-19+7.58942e-19*ii, -.61274+.645193*ii}}

o14 : List

i15 : 
