-- -*- M2-comint -*- {* hash: -1057685552 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R = CC[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : F = { (y^2+x^2+z^2-1)*x, (y^2+x^2+z^2-1)*y }

       3      2      2       2     3      2
o2 = {x  + x*y  + x*z  - x, x y + y  + y*z  - y}

o2 : List

i3 : NV = bertiniPosDimSolve(F)
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-69414-0/1

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o3 = NV

o3 : NumericalVariety

i4 : W = NV#1_0 --z-axis

o4 = W

o4 : WitnessSet

i5 : bertiniSample(4, W)
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-69414-0/2

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o5 = {{0, 0, -.190019-.361954*ii}, {3.58931e-276+2.57136e-276*ii, 0,
     ------------------------------------------------------------------------
     -.257882-.273123*ii}, {0, 0, .184308-.242575*ii},
     ------------------------------------------------------------------------
     {4.94066e-323-2.47033e-323*ii, 4.94066e-324+9.88131e-324*ii,
     ------------------------------------------------------------------------
     -.277509-.186526*ii}}

o5 : List

i6 : 
