-- -*- M2-comint -*- {* hash: 60180598 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R=CC[u1,u2,u3,x,y];

i2 : f1=u1*(y-1)+u2*(y-2)+u3*(y-3); --parameters are u1, u2, and u3

i3 : f2=(x-11)*(x-12)*(x-13)-u1;

i4 : paramValues0={1,0,0};

i5 : paramValues1={0,1+2*ii,0};

i6 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2,u3},{paramValues0 ,paramValues1 })
{x, y}
~/bertini
~/bertini
~/bertini

o6 = {{{11.3376-.56228*ii, 1}, {11.3376+.56228*ii, 1}, {13.3247, 1}}, {{11,
     ------------------------------------------------------------------------
     2}, {12, 2}, {13, 2}}}

o6 : List

i7 : bPH_0--the solutions to the system with parameters set equal to paramValues0

o7 = {{11.3376-.56228*ii, 1}, {11.3376+.56228*ii, 1}, {13.3247, 1}}

o7 : List

i8 : R=CC[x,y,z,u1,u2]

o8 = R

o8 : PolynomialRing

i9 : f1=x^2+y^2-z^2

      2    2    2
o9 = x  + y  - z

o9 : R

i10 : f2=u1*x+u2*y

o10 = x*u1 + y*u2

o10 : R

i11 : finalParameters0={0,1}

o11 = {0, 1}

o11 : List

i12 : finalParameters1={1,0}

o12 = {1, 0}

o12 : List

i13 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2},{finalParameters0 ,finalParameters1 },HomVariableGroup=>{x,y,z})
{x, y, z}
~/bertini
~/bertini
~/bertini

o13 = {{{1, 1.61026e-16+2.14806e-16*ii, -1}, {1, -8.07222e-17-5.7286e-18*ii,
      -----------------------------------------------------------------------
      1}}, {{6.04126e-16+1.51767e-16*ii, 1, 1}, {-1.45743e-16-7.8517e-18*ii,
      -----------------------------------------------------------------------
      1, -1}}}

o13 : List

i14 : bPH_0--The two solutions for finalParameters0

o14 = {{1, 1.61026e-16+2.14806e-16*ii, -1}, {1, -8.07222e-17-5.7286e-18*ii,
      -----------------------------------------------------------------------
      1}}

o14 : List

i15 : R=CC[x,u1]

o15 = R

o15 : PolynomialRing

i16 : f1=x^2-u1

       2
o16 = x  - u1

o16 : R

i17 : finalParameters0={1}

o17 = {1}

o17 : List

i18 : finalParameters1={2}

o18 = {2}

o18 : List

i19 : bPH=bertiniParameterHomotopy( {f1}, {u1},{finalParameters0 ,finalParameters1 },AffVariableGroup=>{x})
{x}
~/bertini
~/bertini
~/bertini

o19 = {{{-1}, {1}}, {{-1.41421}, {1.41421}}}

o19 : List

i20 : bPH_0--The two solutions for finalParameters0

o20 = {{-1}, {1}}

o20 : List

i21 : 
