<<<<<<< HEAD
-- -*- M2-comint -*- {* hash: -1818738321 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2
=======
-- -*- M2-comint -*- {* hash: -1868039377 *}
-- COMPILE TIME: Oct 14 2015, 14:51:21
--loading configuration for package "Bertini" from file /nethome/aleykin3/.Macaulay2/init-Bertini.m2
>>>>>>> Macaulay2/master

i1 : R=CC[u1,u2,u3,x,y];

i2 : f1=u1*(y-1)+u2*(y-2)+u3*(y-3); --parameters are u1, u2, and u3

i3 : f2=(x-11)*(x-12)*(x-13)-u1;

i4 : paramValues0={{1,0,0}};

i5 : paramValues1={{0,1+2*ii,0}};

i6 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2,u3},{paramValues0 ,paramValues1 })
<<<<<<< HEAD
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-34476-0/1
=======
Temporary directory for input and output files:/tmp/M2-30313-0/1
>>>>>>> Macaulay2/master

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o6 = {{{11.3376-.56228*ii, 1}, {11.3376+.56228*ii, 1}, {13.3247, 1}}, {{11,
     ------------------------------------------------------------------------
     2}, {12, 2}, {13, 2}}}

o6 : List

i7 : bPH_0--the solutions to the system with parameters set equal to paramValues0

o7 = {{11.3376-.56228*ii, 1}, {11.3376+.56228*ii, 1}, {13.3247, 1}}

o7 : List

i8 : R=CC[x,y,z,u1,u2]

o8 = R

o8 : PolynomialRing

i9 : f1=x^2+y^2-z^2

      2    2    2
o9 = x  + y  - z

o9 : R

i10 : f2=u1*x+u2*y

o10 = x*u1 + y*u2

o10 : R

i11 : finalParameters0={{0,1}}

o11 = {{0, 1}}

o11 : List

i12 : finalParameters1={{1,0}}

o12 = {{1, 0}}

o12 : List

<<<<<<< HEAD
i13 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2},{finalParameters0 ,finalParameters1 },IsProjective=>1)
Temporary directory for input and output files:/var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-34476-0/3
=======
i13 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2},{finalParameters0 ,finalParameters1 },ISPROJECTIVE=>1)
Temporary directory for input and output files:/tmp/M2-30313-0/3
>>>>>>> Macaulay2/master

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


<<<<<<< HEAD
o13 = {{{.430111+.518729*ii, -8.37546e-18+2.4395e-19*ii, .430111+.518729*ii},
      -----------------------------------------------------------------------
      {.61274-.645193*ii, -1.6263e-19+7.58942e-19*ii, -.61274+.645193*ii}},
      -----------------------------------------------------------------------
      {{-1.04626e-17+1.29461e-17*ii, -.897674-.40584*ii, .897674+.40584*ii},
      -----------------------------------------------------------------------
      {-1.86347e-18-2.60209e-18*ii, -.256191+.524602*ii,
      -----------------------------------------------------------------------
      -.256191+.524602*ii}}}
=======
o13 = {{{-.728824-.337967*ii, 6.02762e-16+3.20924e-17*ii,
      -----------------------------------------------------------------------
      -.728824-.337967*ii}, {.719626-1.1201*ii, 2.5083e-16-3.07093e-16*ii,
      -----------------------------------------------------------------------
      -.719626+1.1201*ii}}, {{2.9138e-18+1.33465e-16*ii, -.499672+.461577*ii,
      -----------------------------------------------------------------------
      -.499672+.461577*ii}, {1.12323e-16-1.32923e-16*ii, .456259+.890904*ii,
      -----------------------------------------------------------------------
      -.456259-.890904*ii}}}
>>>>>>> Macaulay2/master

o13 : List

i14 : bPH_0--The two solutions for finalParameters0

<<<<<<< HEAD
o14 = {{.430111+.518729*ii, -8.37546e-18+2.4395e-19*ii, .430111+.518729*ii},
      -----------------------------------------------------------------------
      {.61274-.645193*ii, -1.6263e-19+7.58942e-19*ii, -.61274+.645193*ii}}
=======
o14 = {{-.728824-.337967*ii, 6.02762e-16+3.20924e-17*ii,
      -----------------------------------------------------------------------
      -.728824-.337967*ii}, {.719626-1.1201*ii, 2.5083e-16-3.07093e-16*ii,
      -----------------------------------------------------------------------
      -.719626+1.1201*ii}}
>>>>>>> Macaulay2/master

o14 : List

i15 : 
