-- -*- M2-comint -*- hash: 1488243299
--loading configuration for package "FourTiTwo" from file /Users/jo/Library/Application Support/Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /Users/jo/Library/Application Support/Macaulay2/init-Topcom.m2
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R = CC[x,y];

i2 : F = {x^2-1,y^2-2};

i3 : S = bertiniZeroDimSolve F

o3 = {{1, 1.41421}, {1, -1.41421}, {-1, 1.41421}, {-1, -1.41421}}

o3 : List

i4 : peek S_0

o4 = Point{AccuracyEst => 1.38608e-14        }
           AccuracyEstInternal => 4.49777e-15
           ConditionNumber => 7.32801
           Coordinates => {1, 1.41421}
           CycleNumber => 1
           FinalTValue => .000390625
           FunctionResidual => 2.28878e-16
           MaxPrecisionUtilized => 52
           Multiplicity => 1
           NewtonResidual => 6.50986e-17
           PathNumber => 0
           PathsWithSameEndpoint => {}
           PrecisionIncreased => 0
           SolutionNumber => 2

i5 : R = CC[x];

i6 : F = {x^2*(x-1)};

i7 : S = bertiniZeroDimSolve F

o7 = {{1}, {4.94308e-14-2.7598e-14*ii}}

o7 : List

i8 : B = bertiniZeroDimSolve(F,UseRegeneration=>1)

o8 = {{1}}

o8 : List

i9 : 
