-- -*- M2-comint -*- {* hash: -1270144364 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : F={"x*(x+2*y+3*z^2)","(y^3-x+z)*(z)*(x+2*y+3*z^2)"}

o1 = {x*(x+2*y+3*z^2), (y^3-x+z)*(z)*(x+2*y+3*z^2)}

o1 : List

i2 : makeB'InputFile(storeBM2Files,B'Configs=>{{TrackType,1}},AffVariableGroup=>{x,y,z},B'Polynomials=>F)

o2 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-42437-0/0/input

o2 : File

i3 : runBertini(storeBM2Files)
~/bertini

i4 : listPoints=importMainDataFile(storeBM2Files)

o4 = {{-2.0529-1.03318*ii, -.887854-2.95277*ii, 1.39961+.826266*ii},
     ------------------------------------------------------------------------
     {-.771346-.001731*ii, .235843-.403545*ii, -.440115-.306292*ii},
     ------------------------------------------------------------------------
     {4.31252e-18-3.97708e-17*ii, -.462184-.547664*ii,
     ------------------------------------------------------------------------
     -7.95416e-17-8.6250e-18*ii}, {6.43247e-17-1.30001e-16*ii,
     ------------------------------------------------------------------------
     -.800243+.436427*ii, .055202-.755323*ii}, {-1.21603e-16+6.06634e-17*ii,
     ------------------------------------------------------------------------
     1.05772+.03894*ii, -1.17855-.130637*ii}, {0, -.257482-.475367*ii,
     ------------------------------------------------------------------------
     -.157483-.0128741*ii}}

o4 : List

i5 : #listPoints

o5 = 6

i6 : theComponents=sortMainDataComponents(listPoints)

o6 = {{{-2.0529-1.03318*ii, -.887854-2.95277*ii, 1.39961+.826266*ii},
     ------------------------------------------------------------------------
     {-.771346-.001731*ii, .235843-.403545*ii, -.440115-.306292*ii}},
     ------------------------------------------------------------------------
     {{4.31252e-18-3.97708e-17*ii, -.462184-.547664*ii,
     ------------------------------------------------------------------------
     -7.95416e-17-8.6250e-18*ii}}, {{6.43247e-17-1.30001e-16*ii,
     ------------------------------------------------------------------------
     -.800243+.436427*ii, .055202-.755323*ii}, {-1.21603e-16+6.06634e-17*ii,
     ------------------------------------------------------------------------
     1.05772+.03894*ii, -1.17855-.130637*ii}, {0, -.257482-.475367*ii,
     ------------------------------------------------------------------------
     -.157483-.0128741*ii}}}

o6 : List

i7 : for i in theComponents_0 list (i#ComponentNumber,i#Dimension)

o7 = {(0, 2), (0, 2)}

o7 : List

i8 : for i in theComponents_1 list (i#ComponentNumber,i#Dimension)

o8 = {(0, 1)}

o8 : List

i9 : for i in theComponents_2 list (i#ComponentNumber,i#Dimension)

o9 = {(1, 1), (1, 1), (1, 1)}

o9 : List

i10 : 
