-- -*- M2-comint -*- {* hash: -1270144364 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : F={"x*(x+2*y+3*z^2)","(y^3-x+z)*(z)*(x+2*y+3*z^2)"}

o1 = {x*(x+2*y+3*z^2), (y^3-x+z)*(z)*(x+2*y+3*z^2)}

o1 : List

i2 : makeB'InputFile(storeBM2Files,B'Configs=>{{TrackType,1}},AffVariableGroup=>{x,y,z},B'Polynomials=>F)

o2 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-59682-0/0/input

o2 : File

i3 : runBertini(storeBM2Files)
~/bertini

i4 : listPoints=importMainDataFile(storeBM2Files)

o4 = {{6.59683-1.98777*ii, 1.15283-7.55926*ii, 1.3154+2.16744*ii},
     ------------------------------------------------------------------------
     {-.17329-.907624*ii, .161131-.244158*ii, -.457328-.50873*ii},
     ------------------------------------------------------------------------
     {-1.20737e-17-5.6067e-19*ii, .0312926-.334155*ii,
     ------------------------------------------------------------------------
     1.10976e-17-4.84709e-17*ii}, {4.39325e-17-1.26767e-16*ii,
     ------------------------------------------------------------------------
     .887955+.213024*ii, -.579236-.49422*ii}, {1.18416e-17-3.0301e-19*ii,
     ------------------------------------------------------------------------
     .0266599-.298517*ii, .00710821-.0259649*ii}, {1.89067e-17+2.961e-17*ii,
     ------------------------------------------------------------------------
     -.914615+.085492*ii, .74504-.213923*ii}}

o4 : List

i5 : #listPoints

o5 = 6

i6 : theComponents=sortMainDataComponents(listPoints)

o6 = {{{6.59683-1.98777*ii, 1.15283-7.55926*ii, 1.3154+2.16744*ii},
     ------------------------------------------------------------------------
     {-.17329-.907624*ii, .161131-.244158*ii, -.457328-.50873*ii}},
     ------------------------------------------------------------------------
     {{-1.20737e-17-5.6067e-19*ii, .0312926-.334155*ii,
     ------------------------------------------------------------------------
     1.10976e-17-4.84709e-17*ii}}, {{4.39325e-17-1.26767e-16*ii,
     ------------------------------------------------------------------------
     .887955+.213024*ii, -.579236-.49422*ii}, {1.18416e-17-3.0301e-19*ii,
     ------------------------------------------------------------------------
     .0266599-.298517*ii, .00710821-.0259649*ii}, {1.89067e-17+2.961e-17*ii,
     ------------------------------------------------------------------------
     -.914615+.085492*ii, .74504-.213923*ii}}}

o6 : List

i7 : for i in theComponents_0 list (i#ComponentNumber,i#Dimension)

o7 = {(0, 2), (0, 2)}

o7 : List

i8 : for i in theComponents_1 list (i#ComponentNumber,i#Dimension)

o8 = {(0, 1)}

o8 : List

i9 : for i in theComponents_2 list (i#ComponentNumber,i#Dimension)

o9 = {(1, 1), (1, 1), (1, 1)}

o9 : List

i10 : 
