-- -*- M2-comint -*- {* hash: -1270144364 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : F={"x*(x+2*y+3*z^2)","(y^3-x+z)*(z)*(x+2*y+3*z^2)"}

o1 = {x*(x+2*y+3*z^2), (y^3-x+z)*(z)*(x+2*y+3*z^2)}

o1 : List

i2 : makeB'InputFile(storeBM2Files,B'Configs=>{{TrackType,1}},AffVariableGroup=>{x,y,z},B'Polynomials=>F)

o2 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-69617-0/0/input

o2 : File

i3 : runBertini(storeBM2Files)
~/bertini

i4 : listPoints=importMainDataFile(storeBM2Files)

o4 = {{-2.9852+1.99625*ii, 2.86911-.509569*ii, .167461-.972478*ii},
     ------------------------------------------------------------------------
     {.485714+.850525*ii, .172596+.132383*ii, -.305471+.608508*ii},
     ------------------------------------------------------------------------
     {-2.31006e-18+7.51585e-18*ii, -.031525+.0688523*ii,
     ------------------------------------------------------------------------
     -1.6048e-17+8.13212e-18*ii}, {-7.63266e-18-4.16126e-17*ii,
     ------------------------------------------------------------------------
     -.155229+.803577*ii, -.29697+.46081*ii}, {-9.65463e-18+2.37598e-18*ii,
     ------------------------------------------------------------------------
     .187223-.872807*ii, .421313-.573116*ii}, {-1.63281e-18-9.87118e-19*ii,
     ------------------------------------------------------------------------
     -.0319946+.0692303*ii, -.000427283+.000119205*ii}}

o4 : List

i5 : #listPoints

o5 = 6

i6 : theComponents=sortMainDataComponents(listPoints)

o6 = {{{-2.9852+1.99625*ii, 2.86911-.509569*ii, .167461-.972478*ii},
     ------------------------------------------------------------------------
     {.485714+.850525*ii, .172596+.132383*ii, -.305471+.608508*ii}},
     ------------------------------------------------------------------------
     {{-2.31006e-18+7.51585e-18*ii, -.031525+.0688523*ii,
     ------------------------------------------------------------------------
     -1.6048e-17+8.13212e-18*ii}}, {{-7.63266e-18-4.16126e-17*ii,
     ------------------------------------------------------------------------
     -.155229+.803577*ii, -.29697+.46081*ii}, {-9.65463e-18+2.37598e-18*ii,
     ------------------------------------------------------------------------
     .187223-.872807*ii, .421313-.573116*ii}, {-1.63281e-18-9.87118e-19*ii,
     ------------------------------------------------------------------------
     -.0319946+.0692303*ii, -.000427283+.000119205*ii}}}

o6 : List

i7 : for i in theComponents_0 list (i#ComponentNumber,i#Dimension)

o7 = {(0, 2), (0, 2)}

o7 : List

i8 : for i in theComponents_1 list (i#ComponentNumber,i#Dimension)

o8 = {(0, 1)}

o8 : List

i9 : for i in theComponents_2 list (i#ComponentNumber,i#Dimension)

o9 = {(1, 1), (1, 1), (1, 1)}

o9 : List

i10 : 
