-- -*- M2-comint -*- {* hash: -1270144364 *}
--loading configuration for package "Bertini" from file /Users/jo/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : F={"x*(x+2*y+3*z^2)","(y^3-x+z)*(z)*(x+2*y+3*z^2)"}

o1 = {x*(x+2*y+3*z^2), (y^3-x+z)*(z)*(x+2*y+3*z^2)}

o1 : List

i2 : makeB'InputFile(storeBM2Files,B'Configs=>{{TrackType,1}},AffVariableGroup=>{x,y,z},B'Polynomials=>F)

o2 = /var/folders/j_/gx42s4z576z_vj47_ym0j5xm0000gn/T/M2-51733-0/0/input

o2 : File

i3 : runBertini(storeBM2Files)
~/bertini

i4 : listPoints=importMainDataFile(storeBM2Files)

o4 = {{.205481-3.27852*ii, 4.28531+.862108*ii, .150873+1.71701*ii},
     ------------------------------------------------------------------------
     {-.759668-.722327*ii, -.0589054-.0887679*ii, -.596427-.25146*ii},
     ------------------------------------------------------------------------
     {-5.56105e-18-5.52477e-18*ii, -.210314-.386929*ii,
     ------------------------------------------------------------------------
     -9.14671e-17-2.4722e-18*ii}, {1.06489e-17+2.25131e-17*ii,
     ------------------------------------------------------------------------
     .695643-.551049*ii, .297071+.632659*ii}, {-6.47529e-17-3.17845e-17*ii,
     ------------------------------------------------------------------------
     -.482246+.865668*ii, -.972005+.044752*ii}, {1.04946e-17-1.16841e-17*ii,
     ------------------------------------------------------------------------
     -.213397-.314619*ii, -.0536516+.0118389*ii}}

o4 : List

i5 : #listPoints

o5 = 6

i6 : theComponents=sortMainDataComponents(listPoints)

o6 = {{{.205481-3.27852*ii, 4.28531+.862108*ii, .150873+1.71701*ii},
     ------------------------------------------------------------------------
     {-.759668-.722327*ii, -.0589054-.0887679*ii, -.596427-.25146*ii}},
     ------------------------------------------------------------------------
     {{-5.56105e-18-5.52477e-18*ii, -.210314-.386929*ii,
     ------------------------------------------------------------------------
     -9.14671e-17-2.4722e-18*ii}}, {{1.06489e-17+2.25131e-17*ii,
     ------------------------------------------------------------------------
     .695643-.551049*ii, .297071+.632659*ii}, {-6.47529e-17-3.17845e-17*ii,
     ------------------------------------------------------------------------
     -.482246+.865668*ii, -.972005+.044752*ii}, {1.04946e-17-1.16841e-17*ii,
     ------------------------------------------------------------------------
     -.213397-.314619*ii, -.0536516+.0118389*ii}}}

o6 : List

i7 : for i in theComponents_0 list (i#ComponentNumber,i#Dimension)

o7 = {(0, 2), (0, 2)}

o7 : List

i8 : for i in theComponents_1 list (i#ComponentNumber,i#Dimension)

o8 = {(0, 1)}

o8 : List

i9 : for i in theComponents_2 list (i#ComponentNumber,i#Dimension)

o9 = {(-1, 1), (-1, 1), (-1, 1)}

o9 : List

i10 : 
