-- -*- M2-comint -*- {* hash: 1509569113 *}
-- COMPILE TIME: Oct  7 2016, 07:56:28
--loading configuration for package "PHCpack" from file /Users/leykin/Library/Application Support/Macaulay2/init-PHCpack.m2

i1 : R=CC[a,b,c,d];

i2 : M=matrix for i to 2 list for j to 3 list random(1,R)+random(0,R);
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

             3       4
o2 : Matrix R  <--- R

i3 : I=minors(3,M);

o3 : Ideal of R

i4 : f=flatten entries gens I;

i5 : (w,ns) = topWitnessSet(f,2);
*** variables in the ring : {a, b, c, d, zz1, zz2} ***

i6 : slcmat = matrix applyTable (entries w.Slice, x->1_CC*realPart x);

                2          7
o6 : Matrix CC    <--- CC
              53         53

i7 : Rtwo = ring w.Equations;

i8 : X = transpose matrix {gens Rtwo | {1_CC}};

                7          1
o8 : Matrix Rtwo  <--- Rtwo

i9 : slcRR = flatten entries (promote(slcmat,Rtwo) * X);

i10 : fsols = intersectSlice(w,slcRR)

o10 = {{-.160433+.502276*ii, -.250876-.283018*ii, -.458298+.265313*ii,
      -----------------------------------------------------------------------
      .488333+.0406573*ii, 1.27932e-15+3.13775e-16*ii,
      -----------------------------------------------------------------------
      1.02287e-15+1.90667e-16*ii}, {-.258333+.0198612*ii,
      -----------------------------------------------------------------------
      -.328405-.983426*ii, -.597153-.627988*ii, .306118-1.27541*ii,
      -----------------------------------------------------------------------
      -1.55186e-15-1.16296e-15*ii, 5.81318e-16-2.24542e-15*ii},
      -----------------------------------------------------------------------
      {1.2725-2.27501*ii, -1.46543+2.63707*ii, .0312356-.311748*ii,
      -----------------------------------------------------------------------
      .069555+1.59584*ii, 2.04069e-15+3.16672e-14*ii,
      -----------------------------------------------------------------------
      3.07554e-15-1.1173e-14*ii}, {-.209174+.333792*ii, -.264447-.2141*ii,
      -----------------------------------------------------------------------
      -.510992+.159229*ii, .430489-.0071559*ii, 3.72462e-16+8.32823e-16*ii,
      -----------------------------------------------------------------------
      6.15474e-16+5.76756e-16*ii}, {1.06495+4.00686*ii, -1.57721-1.87023*ii,
      -----------------------------------------------------------------------
      -.228607+2.371*ii, -.247679+.833344*ii, 1.24865e-13-6.46455e-14*ii,
      -----------------------------------------------------------------------
      3.9682e-14-8.35274e-14*ii}, {-.663008+.28555*ii, -.334318-.842505*ii,
      -----------------------------------------------------------------------
      -.964538-.296786*ii, -.033909-.872166*ii, -1.68909e-15-1.07908e-15*ii,
      -----------------------------------------------------------------------
      -4.20541e-15+4.5392e-16*ii}}

o10 : List

i11 : 
